{
    "version": "https://jsonfeed.org/version/1",
    "title": "abbasdp",
    "description": "",
    "home_page_url": "https://abbasdp.ir",
    "feed_url": "https://abbasdp.ir/feed.json",
    "user_comment": "",
    "author": {
        "name": "عباس داورپناه"
    },
    "items": [
        {
            "id": "https://abbasdp.ir/dstn-tshkhyl-wlyn-jmaah-fyngrkhdr/",
            "url": "https://abbasdp.ir/dstn-tshkhyl-wlyn-jmaah-fyngrkhdr/",
            "title": "داستان تشکیل اولین جامعه (فینگرکدر)",
            "summary": "من قبلا در مورد چگونی تشکیل جامعه فینگرکدر یک پست در ویرول منتشر کردم و حتی در همون روز های ابتدایی در موردش چیزایی نوشتم اما اینجا میخوام از تحربه خودم در تشکیلش صجبت کنم مطمعن هستم خیلی از عزیزانی که این پست رو مطالعه&hellip;",
            "content_html": "<p>من قبلا در مورد چگونی تشکیل جامعه فینگرکدر یک پست در ویرول منتشر کردم و حتی در همون روز های ابتدایی در موردش چیزایی نوشتم</p>\n<p>اما اینجا میخوام از تحربه خودم در تشکیلش صجبت کنم</p>\n<p>مطمعن هستم خیلی از عزیزانی که این پست رو مطالعه میکنید مثل روز اول خودم فاقد هیچگگونه اشنایی و اصولی دست به این کار میزنید </p>\n<p>بزار داستانش رو براتون بگم قبلش بد نیست اینو بدونی که من یک برنامه نویس درون گرای بشدت دور از جامعه بودم که بزور جمعه ها از اتاقم بیرون میومدم</p>\n<p>اما یه دوستی داشتم که آخر هفته ها اونم هر از گاهی با هم میرفتیم بیرون و من از قرار گرفتن در اجتماع غیرتخصصی خودم امتنا داشتم نمیدونم خبو بود یا بد اما دلم میخواست بیرون رفتننم هم با برنامه نویس ها باشه و رفیقام از اون دسته باشن</p>\n<p>همین حساسیت باعث شد من از همین بیرون رفتن ها هم اجتناب کنم </p>\n<p>یه روز از طرف دوستم یه پست برام فوروارد شد از نشست شیرازلاگ و من اون موقع برای اولین بار بود وارد چنین نشست هایی میشدم و چون استاد اونجا بود رفتیم و بشدت اون چند ساعت رو کیف کردم چون دور تا دورر ادم های تخصصی و برنامه نویس بودن و تفریح به سبک فنی بود برام چون از اتاقم خارج شدم </p>\n<p>خیلی نمیخوام داستان تعریف کنم براتون و بیشتر میخوام برم سره اصل مطلب چگونگی اولین جامعه ای که من</p>\n<p>تشکیلش دادم </p>\n<p>ما وارد فضای تاریک در کشور شدیم و متاسفانه در دورانی بود که کشت و کشتار و هزاران اتفاق بد داشت میافتاد و به واسطه همین موارد همه از نظر روحی حال بدی رو داشتیم م</p>\n<p>زمان زیادی داشت از اون شرایط میگذشت و من حالم خیلی بد بود و به یکی از افرادی که در شیرازلاگ باهاش اشنا و دوست شده بودم تکست دادم بیا اخر هفته بریم پارک و یکمی از این فضا دور بشیم بردیا قبول کرد و من اگهی در دیوار زدم و خواستم افراد بیشتری رو جذب کنم حدود ۶ نفر شدیم و در بلوار سلامت شیراز یه دورهمی تخصصی تشکیل دادیم که یادمه در همون زمان اعتراض هایزیادی اتفاق میافتاد در اون مکان که چندین بار گشت به ما گیر داد </p>\n<p>اما در اخرش هممون خیلی راضی بودیم و سبک شده بودیم و انرژس زیادی ازش دریافت کردیم این موضوع رو مطرح کردم که برگزاری در این محیط که مرکز اعتراض ها هست ممکنه بهمون اسیب بزنه و بهتره به دنبال یه فضای ساکت تر و امن باشیم </p>\n<p>اینجا علیرضا پیشنهاد داد که دفترمون هست و جمعه ها خالیه و نظرت چیه بریم اونجا یه ۱۰ نفری هم ظرفیت داریم براش منم قبول کردمو رفتیم برای هفته بعد</p>\n<p>اینجا بچه ها پیشنهاد دادن بیا یه روحی به این گروه بدیم اخه در ابتدا فکر میکردیم یک گروه هستیم البته خیلی تو بهر مفهوم واژه ها نمیرم اما اون موقع با این تفکر رفتیم جلو </p>\n<p>من نشستم ساعت ها به انتخاب یک اسم برای این گروه فکر کردم خیلی تفکرگرا بودم و دنبال یه اسم همینجوری نبودم و میخواستم با هدفی که میخواییم بریم براش یکسو باشه حداقل یک معنایی از برنامه نویسی و گروهی که تشکیل دادیم داشته باشه</p>\n<p>و در نهایت با کلی دو دو تا چهار تا کردن به واژه فینگرکدر رسیدم و خلاصه تفکرش میشه اینکه با انگشست هامون کد میزنیم و در زمان کد زدن فکر میکنیم و کد خلق میشه و از در کنار هم قرار گیری دکمه های کیبورد مفهومی به واژه تشکیل گروه فینکرگدر دادم اگه میبینی الانم دارم میگم گروه چون دارم با تفکر اون موقع میام جلو تا بتونم منتقل کنم چطوری شروع شد</p>\n<p>ما برای شروع اولین نشست از بچه ها خواستیم در دانشگاه ها و گروه های تخصصی یا عیر تخصصی خودشون این مورد رو اطلاع بدن البته تعداد زیادی نبودیم که بخواییم همه رو گروه ها رو پوشش بدن اما به همون اندازه ای که بودیم پوشش دادیم و اولین نشست رو موضوع  رو گذاشتم کد های انگشتی و از پلتفرم ثبت نام رویداد ها یعنی ایوند استفاده کردیم و رویداد رایگان گذاشتیم </p>\n<p>بازخورد ثبت نام ها خیلی خوب بود و نزدیک ۲۲ نفر ثبت نامی داشتیم و این مورد به من این انگیزه رو میداد که با قدرت باید ادامه بدم </p>\n<p>رسیدیم به روز نشست و علیرضا پیشنهاد داد برای افتتاحیه یه کیکی بگیرم و این مدلی جشن بگیریم منم موافقت کردم و یه کیک گرفتیم و امدیم داخل دفتر در انتظار شرکت کننده ها همیشه اولین حضور و ورد شرکت کننده رو یادم نمیره اولین نفر علی قارصی فرد بود که اومد مدتی گذشت که ما دیدیم که از ۲۲ نفر فقط ۶ نفر حضور دارن و این مورد یکمی ناراحت کننده بود و در کل مدل رایکان بودن این مدل رویداد همینه و من به فاطمعه فیضی سپردم که تماس بگیره و جویا بشه چرا دیگر افراد نیومدن که در نتیجه فهمیدیم با بهونه های مختلف اجتناب شده از حضور</p>\n<p>شروع گفتگو سخت بود هم ادم های جدید اومده بودن هم من نمیدونستم چطور شروع کنم حتی تمرین برای شروع نداشتم پس اودمم با معرفی شروع کردم و بجه ها به ترتیب شروع کردن و خوشحال بودم با افراد جدیدی آشنا میدشم بعد از اشنایی میخواستم بحثی بندازم وسط تا همه مشارکت کنند اینجا علیرضا زارع اومده بود و اشنا شده بودیم که در این زمینه خوب بحث گرم کن بود و همه داشتن مشارکت میکدن در اون بحث و فتکو ها </p>\n<p>و بعد از گذشت ساعتی از اون گفتگو ها من نظر بجه ها رو راجب فینگرکدر خواستم که ری اکشن خوبی رو در پیش داشت و کیک اوردیم و جشن رو شروع کردیم و عکس دسته جمعی گرفتیم</p>\n<p> </p>\n<p>بو در اخر با نظر بچه ها جهت حفظ ارزش گذاری قرار شد حداقل مبلغی که اون موضع ۱۰ هزارتومان توسیت شد رو در نظر بگیریم و این مدلی ورودی بگیریم تا  از عدم حضور افراد جلو گیری بشه</p>\n<p> </p>\n<p>خوب تا اینجا این ترجبه من در اولین برگزاری و همچنین اولین جامعه بود </p>\n<p>من روز اول فاقد هیچ دانشی و به صرف یک هدف اقدام به انجام این کار کردم </p>\n<p>خیلی گروه ها هستند که در ابتدای مسیر با سخت ترین موارد دست و پنجه نرم میکنند و متاسفانه یا خیلی دور شروع میکنند یا دلسرد میشن از شروع مردن </p>\n<p>شروع کردن خیلی مهم تر هست مهم نیست برای پیروی یک مسیر پیاده راه میری یا با وسیله ای چیزی هستی مهم شروع کردن هست و استمرار و برنامه های اینده</p>\n<p> </p>\n<p>من یک برنامه نویس. درون گرای دور از جامعه بودم و الان تبدیل شدم به یک تشکیل دهنده جامعه و گروه های مختلف و الان هدفم تغییر کرده و گسترش جوامع رو اولویت اصلیم قرار دادم و کد دورم نه اینکه کامل دور باشم اما به تمرکزم روی جوامع قرار دادم</p>\n<p>و یجورایی کسب درامدم همین در همین قسمت هست هر کسی هم معترض شد که نه جاومع عام المنفعه باید داوطلبانه باشه و پول توش نباشه توجهی به اون دسته افراد نداشته باشید  و ای دی منو بدید بهشون تا با اصل واژه عام المنفعه اشناشون کنم و از طرفی هم درامد من از سمت جوامع عام المنفعه نیست اما در کل خیلی ها خودشون رو محدود میکنند به واژه هایی که به غلط داره معنی میشه </p>\n<p> </p>\n<p>در کل شروع کردن و گسترش دادن خیلی مهمه و اگه علاقه داری یانو بدون لازم نیست برای تشکیل هر جامعه ایی حتماا متخصص اون حوزه باشه این باور غلط که حتما باید فلان باشی و غیره رو هم بریزید دور </p>\n<p>به طور مقال برای تشکیل لاگ لازم نیست شما یک سیس ادمین خفن باشی برای تشکیل جامعه و شخثی که داوطلبی احرایی یا بنیان گذار اون جامعه میشه هیچ الزامی به سواد اکادمی اون حوزه نیست و همین که اشناییی نسبی و علاقه وجود داشته باشه کافیه </p>\n<p>البته این حرف من به این معنی نیست که کلا چیزی از اون حوزه ندونی هم امکان پذیره البته در برخی موارد یا برخی حوزه ها امکان پذیر باشه اما بعضی حوزه ها لازمه حداقل اطلاعاتی راحبش داشته باشید</p>\n<p>در کل چون این رویکرد یک کاره گروهی هست میتونید از افراد تحصصی تر در بخش های فنی کمک بگیرید که من در اینده در پستی در مورد مدل تیم سازی و استفاده و مدیریت یک پست منتشر میکنم</p>\n<p> </p>\n<p>نظراتتون خیلی مهمه حتی اگه سوالی داری ممنون میشم زیر این پست بنویسی</p>\n<p>این پست به صورت آزاد و با پروانه انتشار منتشر شده </p>\n<p>استفاده و کپی برداری برای عموم آزاد می باشد </p>\n<p> </p>",
            "image": "https://abbasdp.ir/media/posts/12/IMG_20241005_200701.jpg",
            "author": {
                "name": "عباس داورپناه"
            },
            "tags": [
            ],
            "date_published": "2024-10-15T02:17:17+03:30",
            "date_modified": "2024-10-30T07:19:43+03:30"
        },
        {
            "id": "https://abbasdp.ir/chtwr-tshkhyl-jmaah-bdym-khmywnyty/",
            "url": "https://abbasdp.ir/chtwr-tshkhyl-jmaah-bdym-khmywnyty/",
            "title": "چطور تشکیل جامعه بدیم (کامیونیتی)",
            "summary": "تشکیل (کامیونیتی) یا همون واژه پارسی‌ش جامعه، شامل همه گروه ها میشه به طور مثال شما اگه یک گروه خانوادگی دارید که هر هفته میرید مسافرت یا غیره شما یک جامعه هستید که جنس اون جامعه از نوع خانوادگی هست جوامع مدل های مختلفی داره&hellip;",
            "content_html": "<p>تشکیل (کامیونیتی) یا همون واژه پارسی‌ش جامعه، شامل همه گروه ها میشه به طور مثال شما اگه یک گروه خانوادگی دارید که هر هفته میرید مسافرت یا غیره شما یک جامعه هستید که جنس اون جامعه از نوع خانوادگی هست </p>\n<p>جوامع مدل های مختلفی داره اما من اینجا قراره در مورد تشکیل جامعه های تک و جامعه های تخصصی صحبت کنم </p>\n<p>ممکنه مثل من علاقه مند باشی که گروه های برنامه نویسی و نرم افزار آزاد تشکیل بدی </p>\n<p>یا خودت داوطلب اجرایی رویداد ها و همایش ها باشی</p>\n<p>ولی نمیدونی چطور شروع کنی ؟</p>\n<p>من اینجام تا تحربه های خودم رو باهاتون به اشتراک بزارم </p>\n<p>قبل از هر چیزی اینو بدون که برای شروع <strong><span style=\"color: #169179;\">همین که جسارت کردی بهش حتی فکر کنی کافیه</span></strong> </p>\n<p>و مورد بعدی خیلی نیار نیست در ابتدا ۱۰۰ خدوتو بزاری یا خفن ترین رو ارائه بدی هر چند خفن ترینی وجود نداره اما همیشه از منفی ۰ باید شروع کنیم </p>\n<p>در ابتدای مسیر ممکنه تنها باشی و همه چیو تنهایی بخوای انجام بدی بازم نگران نباش منم ابتدای مسیر خودم تنها بودم یواش یواش افراد مختلفی میان که میخوان کمکت کنند و حاضر میشن در تشکیل تیمت وارد بشن بد نیست این قسمت یکمی راجب مدیریت تیم بدونی البته اینجا هم میگم که سخت نگیر نیازی نیست سال ها دوره های مدیریت بابتش بگذرونی نه اصلا یه سری کتاب هست که چند ساعته میتونه دانش این قسمتت رو افزایش بده و صد البته تجربه هایی که کسب میکنی از هر منبعی معتبر تره </p>\n<p> </p>\n<p>و بریم سر اصل مطب من با این پیش فرض میام جلو که شما قصد داری در شهر خودت یا محله خودت یا دانشگاه یا اصلا در یک فضای مجازی جامعه ای تخصصی تشکیل بدی و با پیش فرض میگیریم که قراه یک جامعه برنامه نویسی تشکیل و اجرا بشه </p>\n<p>در ابتدا یک گزینه برای چرایی این کار پیدا کن دقت کن قرار نیست همون روز اول ۱۰۰ تا هدف یا رودمپ و پلن ریخته بشه به طور مثال میتونی با یان بهونه که چنین جامعه ای نیست و اگر هست مدلی که تو میخوایی نیست میتونی شروع کنی</p>\n<p>در مرحلهع بعدی لازمه یک اسم براش انتخاب کنی اما خیلی وقت خودتو درگیر نکن اگه مثل من حساس هستی میتونی برای شروع با یه اسم موقت شروع کنی و بعدش تغییرش بدی </p>\n<p>به همین راحتی</p>\n<p>خوب حالا اسم رو انتخاب کردم لوگو رو چیکار کنم ؟</p>\n<p>سعی کن خیلی سمت محدودیت ها نی برای لوگو هم در ابتدا اصلا لازم نیست یه چیز خفن ارائه بشه میتونی از هوش مصنوعی و سایت های لوگو ساز کمک بگیری و بازم این قسمت قابل تغییر هست در اینده و خیلی حساسیت روش نداشته باش</p>\n<p>خوب حله من لوگو و اسم و هدف رو انتخاب کردم چطور شروع کنم ؟</p>\n<p>شروع کردن جسارت خیلی بزرگی میخواد و این مرحله بلوغ اجرایی جامعه شما رو نشون میده برای شروع کردن سخت نگیر بای دیفالت در نر گرفتیم که قرار یک جامعه برنامه نویسی تشکیل بشه پس بگرد داخل گروه های مرتبط به این حوزه و علااقه مندان رو پیدا کن و اگر جامعهت محدود به یک شهره برو داخل کروه های اون شهر بگرد برای پیدا کردن گروه از هیج چیز دریغ نکن حتی میتونی یه اگهی در دیوار بزاری البته در بخش رویداد ها و اونجا اعلام کنی و هر جایی که علاقه مندی میبینی اینکارو بکن و اطلاع رسانی کن </p>\n<p>و بعدش لازمه که تصمیم بگیری کی و چه موقع اولین نشست رو بزاری </p>\n<p>حالا اینجا سوال میشه چطوری اطلاع رسانی کنم ببین اسم که انتخاب شده پس با همون اسم در تلگرام یا هر سوشال مدیای دیگه ای کانال و صفحه خودت رو بساز برای شروع فعلا لازم نیست سایت طراحی کنی حتی در صورتی که جزو اهدافت بود اما برای شروع سخت نگیر</p>\n<p>خیلی ساده یک موضوع برای نشست میزای معمولا نشست اول رو میتونی این مدلی بزاری که هدفمون چیه و از این موارد که بقیه مشارکت کنند بعدش لازمه که روز ساعت و تایم رویداد رو اطلاع رسانی کنی و حالا اگه حضور برای عموم ازاده که اعلام میکنی که ازاده در غیر اینصورت مدل ثبت نام یا هماهنگی رو در همون پست اعلام بکن </p>\n<p>خوب حالا اینکارو کردی مکان برگزاری رو چیکار کنیم</p>\n<p>اصلا اصلا در این قسمت سخت نگیر تشکیل جوامع متاسفانه دچار تجمل گرایی شده و لازمه که برای شروع در نظر بگیری که هر چی ساده تر راحت تری هدف ما اینه که افراد همسو با اهداف خودمون رو گرد هم جمع کنیم و صحبت کنیم ارائه بدیم و غیره پس خیلی نباید در این بخش سخت بگیریم من خودم به شدت با این مورد مخالفم اما درسته که مکان برگزاری و استاندارد های اون مکان به کیفیت اون نشیت یا رویداد کمک میکنه اما الزامی نیست چ.ن متاسفانه دیده شده خیلی از داوطلب ها به همین بهانه دست از اجرا کشیدند</p>\n<p>پس ببین برای شروع بسته به فصلی که قراره داخلش شروع کنی و اب و هوای شهرت اگه مقدرو بود از پارک میتونی شروع کنی و حالا میتونی محیط های کافی شاپی رزرو کنی و به همین ترتیب دانشگاه ها هستند و مدارس </p>\n<p>و مورد بعدی گه در رزرو مکان کمکتون میکنه اینه که از هر ارگانی که میشناسید درخواست کنید حتی اونایی که فکر نمیکنید حمایت کنند یه تیری بندازید طبق تجربه یکی از دوستان در تهران به یک مرکز خیریه عنوان کرد این مورد رو و از طرف همون مرکز سالن به رایگان اختصاص داده شد برای برگزاری اون رویداد ها </p>\n<p>پس مکان خیلی راحت میشه جورش کرد و اگه جور نشد محدود نکنیم خودمون رو و شروع کنیم این نکته رو در نظر بگیرید چیزی که اعتبار میده به اون جامعه تعداد برگزاری و مدل برگزاری هست پس برگزار کنید به هر شکل و در هر مکان تا توجه ها جلب بشه اون موقع از سمت ارگان هایی درخواست حمایت دریافت میکنید که روز اول فکرشم نمیکردید این ارگان ها یا شرکت ها تو.جه‌شون جلب بشه </p>\n<p>موضوع بعدی که اینجا لازم میشه دنبالش کنید بحث اجرای اول هست</p>\n<p>بله من درک میکنم چقدر استرس در روز اول هست و هیچ وقت هیچ برگزار کننده ای نشست اول رو فراموش نمیکنه - در ابتدا طبق همون موضوعی که قراره صحبت بشه یا ارائه داده بشه شروع کنید خیلی ساده اما قبل ترش بد نیست با شرکت کنندگان خوش و بش کنید و اشنا بشید و حتی یه قسمتی بزارید بچه ها خودشون رو معرفی کنند و اشنا بشن</p>\n<p>اینجا جامعه هست و افرادی که شرکت میکنند میان تا هم حول محور اون موضوع تخصصی حرف بزنند هم آشنایی رو رقم بزنند </p>\n<p> </p>",
            "image": "https://abbasdp.ir/media/posts/11/chris-czermak-7ybKmhDTcz0-unsplash-xs.webp",
            "author": {
                "name": "عباس داورپناه"
            },
            "tags": [
            ],
            "date_published": "2024-09-30T02:16:47+03:30",
            "date_modified": "2024-10-30T07:19:37+03:30"
        },
        {
            "id": "https://abbasdp.ir/about-me/",
            "url": "https://abbasdp.ir/about-me/",
            "title": "درباره من",
            "summary": "توی پست میخوام بیشتر از خودم براتون بگم و یه معرفی بیشتری رو از خودم اینجا قرار بدم نمیخوام زندگی‌نامه براتون بنویسم اما بنظرم از دوران مدرسه مسیر مناسب‌تری برای شروع کردن باشه من جزو یکی از بی‌نظم ترین‌های مدرسه بودم و همیشه یه تنفر&hellip;",
            "content_html": "<p>توی پست میخوام بیشتر از <strong>خودم</strong> براتون بگم و یه معرفی بیشتری رو از خودم اینجا قرار بدم</p>\n<figure class=\"post__image\"><img decoding=\"auto\" loading=\"lazy\"  src=\"https://abbasdp.ir/media/posts/9/photo_2024-09-25-00.58.09.jpeg\" alt=\"\" width=\"640\" height=\"640\" sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://abbasdp.ir/media/posts/9/responsive/photo_2024-09-25-00.58.09-xs.jpeg 640w ,https://abbasdp.ir/media/posts/9/responsive/photo_2024-09-25-00.58.09-sm.jpeg 768w ,https://abbasdp.ir/media/posts/9/responsive/photo_2024-09-25-00.58.09-md.jpeg 1024w ,https://abbasdp.ir/media/posts/9/responsive/photo_2024-09-25-00.58.09-lg.jpeg 1366w ,https://abbasdp.ir/media/posts/9/responsive/photo_2024-09-25-00.58.09-xl.jpeg 1600w ,https://abbasdp.ir/media/posts/9/responsive/photo_2024-09-25-00.58.09-2xl.jpeg 1920w\"></figure>\n<p>نمیخوام زندگی‌نامه براتون بنویسم اما بنظرم از دوران مدرسه <strong>مسیر مناسب‌تری برای شروع کردن باشه</strong> </p>\n<p>من جزو یکی از<strong> بی‌نظم ترین‌های</strong> مدرسه بودم و همیشه یه تنفر بدی به مدرسه رفتن داشتم و همیشه اینو میگفتم که نمیشه بجای ساعت ۷ مدرسه رو دیر تر شروع کرد تا سختی صبح زود بیدار شدن رو نکشیم </p>\n<p class=\"msg msg--highlight \">و بدترین قسمت های زندگی برای من همون صبح زود بیدار شدن و صدای الارم بود </p>\n<p>همینطور وضعیت درسی خوبی هم نداشتم و بازم اینطرف منتقد بودم که <strong>نمره کارنامه</strong> نمیتونه نسبت علمی کسی رو ثابت کنه چرا که سال بعد همون سوال ها رو از هم‌کلاسی هام میپرسیدم کسی جوابشو نمیدونست </p>\n<p class=\"msg msg--highlight \">بخاطر این وضعیت همیشه از سمت معلم هام و خانواده آینده روشنی برام پیش بینی نمیشد و فقط گوشمو پر کرده بودند از این جلات که درس نخونی فلان میشی و همش آینده های بد و خاموش </p>\n<p>ولی من برام اینده روشن یا خاموش مهم نبوده تا همین الانشم پس یه جایی به بعد تحصیلات بد رفت روی مخم و تصمیمم این بود که سریع تر خاتمه بدم به این وضعیت اما سن خیلی کمی داشتم و حدود ۱۲ سالم بود </p>\n<p>من توی اون تایم یه کامپیوتری داشتم که همیشه بخاطر <strong>بدسکتورهای هاردم</strong> مشکل پرش ویندوز داشتم و این مورد انقدر زیاد شد که خودم یاد گرفته بودم ویندوزمو عوض کنم و یواش یواش به واسطه لطف اون مرکز تعمیر کامپیوتری که نزدیک بود بهم قطعات و عیب یابی های مختلف رو شناختم و در حدی میتوونستم برخی از مشکلات رایج رو حل کنم و معمولا تست هامو روی سیستم های فک و فامیل انجام میدادم و تجربه بیشتری کسب کنم </p>\n<p><strong>رسیدم به ۱۴</strong> و تحصیلات خیلی رفته بود روی مخم پس تصمیم قطعی خودومو گرفتم و به خانواده اطلاع دادم که دیگه تحصیلات رو ادامه نمیدم و میخوام دانش اکادمی رو دنبال کنم و برم سرکار (به شدت کاره سختی بود ولی تهش گفتم یا مرگ یا تصمیم خودم در وضعیتی بودم که هیچکس نمیتونست منو منصرف کنه به هیچ روشی )(</p>\n<p>و من با تحصیلات زیر دیپلم دیگه ادامه ندادم و این حرکت باعث شده بود هیچ کس اینده مناسبی رو برام پیش بینی نکنه و حجم این تیکه ها به شکلی بود که کلا توجه ای به این موارد نداشتم چرا که یه موردی که برای من مهم بود حس خودم بود نه دیگران</p>\n<p class=\"msg msg--highlight \">مستقل بودن رو شروع کردم و سرکار رفتم البته هر چند کاری که میکردم مورد علاقم نبود اما به پولش برای یادگیری مهارت های اکادمی نیاز داشتم</p>\n<p>تازه رودمپ مناسب پیدا کرده بودم برای برنامه نویس شدن حقیقت راجبش خیلی تحقیق کرده بودم و در تایم هایی که بیکار میشدم همش جویای این حوزه بودمو با دوره طراحی سایت شروع کردم و مسلط شدم روی طراحی وب پیج ها البته این تخصص جوری نبود بشه باهاش پروژه بگیرم یا جایی مشغول به کار بشم و همچنان داشتم در رستوران های مختلف کار میکردم تا هزینه‌های مورد نیازم رو کسب کنم و از اون طرف اموزشا رو دنبال کنم</p>\n<p class=\"msg msg--highlight \">۱۶ سالگیم بود که با ترجمه قالب های انگلیسی به فارسی و راست چین کردنشون تونستم یکمی پول در بیارم از این حوزه ولی اصلا رقم های قابل توجه ای نبودن و تعدادشون هم زیاد نبود </p>\n<p class=\"msg msg--highlight \">توی ۱۸ سالگی سعی کردم با مفاهیم بیشتر و بهتری از این حوزه آشنا بشم اما در تایم بدی از سن بودم و ۱۸ تا ۲۰ سالگیم بلاتکلیف رفت </p>\n<p>۲۰ سالگیم به مسیر قبل برگشتم و رفتم سراغ فلسفه و<strong> فرهنگ نرم افزار ازاد</strong> یه مستندی ازش دیدم و خیلی جذبش شدم پس یادگیری <strong>برنامه نویسی</strong> رو عقب انداختم تا <strong>لینوکس</strong> رو یاد بگیرم و بعد از اون کلا رفتم توی دل فرهنگ نرم افزار ازاد و بعدشم که تونستم برنامه نویسی رو یاد بگیرم با طراحی ربات های اینستاگرامی و پروژه های این شکلی دیگه بی نیاز شده بودم از کسب درامد خارج از این حوزه </p>\n<p>اینجا ها بود که خیلی دوست داشتم با برنامه نویس های  بیشتری ارتباط داشته باشم تنهایی وو دورن گرایی عصبیم کرده بود ولی اجتماع پایداری وجود نداشت و من کمبودشو به شدت حس میکردم</p>\n<p><strong>بین ۲۱ تا ۲۳</strong> رفتم توی یادگیری عمیق تر لینوکس و شبکه و وارد دواپس هم شدم </p>\n<p>اینجا بود که با <a href=\"shirazsuf.ir\" target=\"_blank\" rel=\"noopener noreferrer\">کارخونه نواوری شیراز</a> آشنا شدم جایی که داخلش میتوونستم برنامه نویس های زیادی رو پیدا کنم و صجبت کنیم و اشتراک زیادی ایجاد کنم یه هم تیمی برای یادگیری دوره دواپسم پیدا کردم و به همین ترتیب وارد کارخونه شدم</p>\n<p>اما بازم این مورد برام کافی نبود من دنبال اجتماع پایدار تری بودم که کل اطرافیانم رو برنامه نویس ها تشکیل بدن اینجا بود که با شیرازلاگ آشنا شدم و از در اولین نشستی که شرکت کردم کلی دوست پیدا کردم و همین مورد استارت دورهمی های خودمونی بین بچه ها بود </p>\n<p>در ادامه تصمیم گرفتم دورهمی برنامه نویسا رو تشکیل بدم و اینکارو کردم و اینجا بود که فینگرکدر تشکیل شد به صورت کاملا خلاصه</p>\n<p>و من انقدر هر هفته اینکارا رو ادامه دادم که بخشی از فعالیت های روزمرگیم شده بود <a href=\"fingercoder.ir\" target=\"_blank\" rel=\"noopener noreferrer\">فینگرکدر</a> در ادامه با قدرت گرفتن فینگرکدر و اضافه شدن ممبر ها و توجه ها و تاثییر گذاری های که داشت رفتم سراغ تشکیل یه جامعه لینوکسی که <a href=\"sudoshz.ir\" target=\"_blank\" rel=\"noopener noreferrer\">شیرازلینوکس</a> رو افتتاح کردم و توی دل برگزاری همایشا وارد شدم که به همایشا توجه بیشتری تا نشست ها داشتم </p>\n<p>این سمت با کسب تجربه های مختلف داوطلب اجرای جوامع زیادی شدم اینجا دقیقاا دور تا دور من از همه دوستام تا اشناها و اطرفیانم برنامه نویس بودن و همشون داوطلبانه حاضر بودن برای کسترش این جوامع همکاری کنند</p>\n<p>توجه <strong>اکوسیستم برگزاری جوامع در شیراز</strong> منو جذب کرد و اینجا میخواستم به هر شکلی که هست همه مناسبت های نرم افزار ازاد تا برنامه نویسی رو اجرا کنم و اولین همایش های برخی از تخصص های نوپا این حوزه رو در شیراز برگزار کنیم </p>\n<p>و همین شد که <strong>همایش ۸۰۰ نفری گنو/لینوکس</strong> رو اجرا کردیم و به همین ترتیب <strong>اولین همایش دواپس ایران</strong> رو هم اجرا کردیم.</p>\n<p>در ادامه یه جامعه هوش مصنوعی هم به شیراز اوردم و <strong>فیلاگراکس‌شیراز</strong> رو تشکیل دادیم </p>\n<p>توی همین اتفاقا من برای مدیریت تیم های داوطلب نیازمند یادگیری دوره های مدیریت شدم و در کنارش منابع های مورد نیاز کارمو دنبال میکردم </p>\n<p class=\"msg--success msg--highlight msg \">و بعد از فیلاگر تشکیل جامعه سی اس فیفتی توجهمو جلب کرده بود که اینجا رو هم با بچه ها شروعش کردیم</p>\n<p class=\"msg msg--highlight \">سال ۱۴۰۲ با تشکیل یک تیم برگزارکننده برای فینگرکدر خودم به عنوان بنیان گذر این جامعه از فینگرکدر خدافظی کردم با هدف ارتقا و تشکیل دیگر جوامع وو انتقال دانش برگزاری </p>\n<p>سی اس فیفتی رو <strong>۶۰ نفر داوطلب</strong> شرووع به برگزاریش کردیم و این طرف بشدت تجربه های مدیریتی - مارکتینگ - روابط عمومی و منابع انسانی دریافت کردم و این جامعه رو هم در <strong>شیراز</strong> اجراش کردیم </p>\n<p>در ادامه همین مطالب لازمه بگم یه جایی به بعد توسعه و ارتقای جامعه های برنامه نویسی شد روتین زندگیم و چندین ساله که فعالیت اصلیم شده همین کار</p>\n<p>خوب تا اینجا این چیزایی بود که لازم بود از خودم بگم </p>\n<p>اما در ادامه خارج از این موارد لازمه بگم این وبلاگ کلا به جهت انتشار تجربه های خودم در خصوص برگزاری های موفق در این زمینه ها طراحی و تشکیل شده البته برخی وقتا ممکنه به موضوعات دیگه ای هم بپردازم ولی در کل هر چیزی که نیازمندی انتقالش رو ببینم و بتونم منتقلش کنم اصلا دریغ نمیکنم و اینکارو ادامه میدم </p>\n<p>در ادامه میگم که اصلا از ترک تحصیل پشیمون نیستم تا امروزم سربازی نرفتم و از اونم پشیمون نیستم در حال حاضر </p>\n<p>از کمک کردن به ادما انرژی خوبی دریافت میکنم و این موردو تووی جامعه های خوم بشدت حس میکنم و اینجا به بعدو خدا میدونه چی میشه ولی هر چی بشه مهم اینه حس خودت خوب باشه</p>\n<p> </p>\n<p>مرسی که تا اینجا اومدی - این پست ممکنه در تاریخ های مختلف آپدیت بگیره و بخش هایی رو بهش اضافه کنم </p>\n<p> </p>",
            "image": "https://abbasdp.ir/media/posts/9/DSC07241-1-Medium.jpeg",
            "author": {
                "name": "عباس داورپناه"
            },
            "tags": [
                   "عباس داوپناه",
                   "fingercoder",
                   "abbasdp"
            ],
            "date_published": "2024-09-28T01:11:21+03:30",
            "date_modified": "2024-10-24T06:47:39+03:30"
        }
    ]
}
