{
    "version": "https://jsonfeed.org/version/1",
    "title": "abbasdp",
    "description": "",
    "home_page_url": "http://abbasdp.ir",
    "feed_url": "http://abbasdp.ir/feed.json",
    "user_comment": "",
    "author": {
        "name": "عباس داورپناه"
    },
    "items": [
        {
            "id": "http://abbasdp.ir/about-me.html",
            "url": "http://abbasdp.ir/about-me.html",
            "title": "درباره من",
            "summary": "توی پست میخوام بیشتر از خودم براتون بگم و یه معرفی بیشتری رو از خودم اینجا قرار بدم نمیخوام زندگی‌نامه براتون بنویسم اما بنظرم از دوران مدرسه مسیر مناسب‌تری برای شروع کردن باشه من جزو یکی از بی‌نظم ترین‌های مدرسه بودم و همیشه یه تنفر&hellip;",
            "content_html": "<p>توی پست میخوام بیشتر از <strong>خودم</strong> براتون بگم و یه معرفی بیشتری رو از خودم اینجا قرار بدم</p>\n<figure class=\"post__image\"><img decoding=\"auto\" loading=\"lazy\"  src=\"http://abbasdp.ir/media/posts/9/photo_2024-09-25-00.58.09.jpeg\" alt=\"\" width=\"640\" height=\"640\" sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"http://abbasdp.ir/media/posts/9/responsive/photo_2024-09-25-00.58.09-xs.jpeg 640w ,http://abbasdp.ir/media/posts/9/responsive/photo_2024-09-25-00.58.09-sm.jpeg 768w ,http://abbasdp.ir/media/posts/9/responsive/photo_2024-09-25-00.58.09-md.jpeg 1024w ,http://abbasdp.ir/media/posts/9/responsive/photo_2024-09-25-00.58.09-lg.jpeg 1366w ,http://abbasdp.ir/media/posts/9/responsive/photo_2024-09-25-00.58.09-xl.jpeg 1600w ,http://abbasdp.ir/media/posts/9/responsive/photo_2024-09-25-00.58.09-2xl.jpeg 1920w\"></figure>\n<p>نمیخوام زندگی‌نامه براتون بنویسم اما بنظرم از دوران مدرسه <strong>مسیر مناسب‌تری برای شروع کردن باشه</strong> </p>\n<p>من جزو یکی از<strong> بی‌نظم ترین‌های</strong> مدرسه بودم و همیشه یه تنفر بدی به مدرسه رفتن داشتم و همیشه اینو میگفتم که نمیشه بجای ساعت ۷ مدرسه رو دیر تر شروع کرد تا سختی صبح زود بیدار شدن رو نکشیم </p>\n<p class=\"msg msg--highlight \">و بدترین قسمت های زندگی برای من همون صبح زود بیدار شدن و صدای الارم بود </p>\n<p>همینطور وضعیت درسی خوبی هم نداشتم و بازم اینطرف منتقد بودم که <strong>نمره کارنامه</strong> نمیتونه نسبت علمی کسی رو ثابت کنه چرا که سال بعد همون سوال ها رو از هم‌کلاسی هام میپرسیدم کسی جوابشو نمیدونست </p>\n<p class=\"msg msg--highlight \">بخاطر این وضعیت همیشه از سمت معلم هام و خانواده آینده روشنی برام پیش بینی نمیشد و فقط گوشمو پر کرده بودند از این جلات که درس نخونی فلان میشی و همش آینده های بد و خاموش </p>\n<p>ولی من برام اینده روشن یا خاموش مهم نبوده تا همین الانشم پس یه جایی به بعد تحصیلات بد رفت روی مخم و تصمیمم این بود که سریع تر خاتمه بدم به این وضعیت اما سن خیلی کمی داشتم و حدود ۱۲ سالم بود </p>\n<p>من توی اون تایم یه کامپیوتری داشتم که همیشه بخاطر <strong>بدسکتورهای هاردم</strong> مشکل پرش ویندوز داشتم و این مورد انقدر زیاد شد که خودم یاد گرفته بودم ویندوزمو عوض کنم و یواش یواش به واسطه لطف اون مرکز تعمیر کامپیوتری که نزدیک بود بهم قطعات و عیب یابی های مختلف رو شناختم و در حدی میتوونستم برخی از مشکلات رایج رو حل کنم و معمولا تست هامو روی سیستم های فک و فامیل انجام میدادم و تجربه بیشتری کسب کنم </p>\n<p><strong>رسیدم به ۱۴</strong> و تحصیلات خیلی رفته بود روی مخم پس تصمیم قطعی خودومو گرفتم و به خانواده اطلاع دادم که دیگه تحصیلات رو ادامه نمیدم و میخوام دانش اکادمی رو دنبال کنم و برم سرکار (به شدت کاره سختی بود ولی تهش گفتم یا مرگ یا تصمیم خودم در وضعیتی بودم که هیچکس نمیتونست منو منصرف کنه به هیچ روشی )(</p>\n<p>و من با تحصیلات زیر دیپلم دیگه ادامه ندادم و این حرکت باعث شده بود هیچ کس اینده مناسبی رو برام پیش بینی نکنه و حجم این تیکه ها به شکلی بود که کلا توجه ای به این موارد نداشتم چرا که یه موردی که برای من مهم بود حس خودم بود نه دیگران</p>\n<p class=\"msg msg--highlight \">مستقل بودن رو شروع کردم و سرکار رفتم البته هر چند کاری که میکردم مورد علاقم نبود اما به پولش برای یادگیری مهارت های اکادمی نیاز داشتم</p>\n<p>تازه رودمپ مناسب پیدا کرده بودم برای برنامه نویس شدن حقیقت راجبش خیلی تحقیق کرده بودم و در تایم هایی که بیکار میشدم همش جویای این حوزه بودمو با دوره طراحی سایت شروع کردم و مسلط شدم روی طراحی وب پیج ها البته این تخصص جوری نبود بشه باهاش پروژه بگیرم یا جایی مشغول به کار بشم و همچنان داشتم در رستوران های مختلف کار میکردم تا هزینه‌های مورد نیازم رو کسب کنم و از اون طرف اموزشا رو دنبال کنم</p>\n<p class=\"msg msg--highlight \">۱۶ سالگیم بود که با ترجمه قالب های انگلیسی به فارسی و راست چین کردنشون تونستم یکمی پول در بیارم از این حوزه ولی اصلا رقم های قابل توجه ای نبودن و تعدادشون هم زیاد نبود </p>\n<p class=\"msg msg--highlight \">توی ۱۸ سالگی سعی کردم با مفاهیم بیشتر و بهتری از این حوزه آشنا بشم اما در تایم بدی از سن بودم و ۱۸ تا ۲۰ سالگیم بلاتکلیف رفت </p>\n<p>۲۰ سالگیم به مسیر قبل برگشتم و رفتم سراغ فلسفه و<strong> فرهنگ نرم افزار ازاد</strong> یه مستندی ازش دیدم و خیلی جذبش شدم پس یادگیری <strong>برنامه نویسی</strong> رو عقب انداختم تا <strong>لینوکس</strong> رو یاد بگیرم و بعد از اون کلا رفتم توی دل فرهنگ نرم افزار ازاد و بعدشم که تونستم برنامه نویسی رو یاد بگیرم با طراحی ربات های اینستاگرامی و پروژه های این شکلی دیگه بی نیاز شده بودم از کسب درامد خارج از این حوزه </p>\n<p>اینجا ها بود که خیلی دوست داشتم با برنامه نویس های  بیشتری ارتباط داشته باشم تنهایی وو دورن گرایی عصبیم کرده بود ولی اجتماع پایداری وجود نداشت و من کمبودشو به شدت حس میکردم</p>\n<p><strong>بین ۲۱ تا ۲۳</strong> رفتم توی یادگیری عمیق تر لینوکس و شبکه و وارد دواپس هم شدم </p>\n<p>اینجا بود که با <a href=\"shirazsuf.ir\" target=\"_blank\" rel=\"noopener noreferrer\">کارخونه نواوری شیراز</a> آشنا شدم جایی که داخلش میتوونستم برنامه نویس های زیادی رو پیدا کنم و صجبت کنیم و اشتراک زیادی ایجاد کنم یه هم تیمی برای یادگیری دوره دواپسم پیدا کردم و به همین ترتیب وارد کارخونه شدم</p>\n<p>اما بازم این مورد برام کافی نبود من دنبال اجتماع پایدار تری بودم که کل اطرافیانم رو برنامه نویس ها تشکیل بدن اینجا بود که با شیرازلاگ آشنا شدم و از در اولین نشستی که شرکت کردم کلی دوست پیدا کردم و همین مورد استارت دورهمی های خودمونی بین بچه ها بود </p>\n<p>در ادامه تصمیم گرفتم دورهمی برنامه نویسا رو تشکیل بدم و اینکارو کردم و اینجا بود که فینگرکدر تشکیل شد به صورت کاملا خلاصه</p>\n<p>و من انقدر هر هفته اینکارا رو ادامه دادم که بخشی از فعالیت های روزمرگیم شده بود <a href=\"fingercoder.ir\" target=\"_blank\" rel=\"noopener noreferrer\">فینگرکدر</a> در ادامه با قدرت گرفتن فینگرکدر و اضافه شدن ممبر ها و توجه ها و تاثییر گذاری های که داشت رفتم سراغ تشکیل یه جامعه لینوکسی که <a href=\"sudoshz.ir\" target=\"_blank\" rel=\"noopener noreferrer\">شیرازلینوکس</a> رو افتتاح کردم و توی دل برگزاری همایشا وارد شدم که به همایشا توجه بیشتری تا نشست ها داشتم </p>\n<p>این سمت با کسب تجربه های مختلف داوطلب اجرای جوامع زیادی شدم اینجا دقیقاا دور تا دور من از همه دوستام تا اشناها و اطرفیانم برنامه نویس بودن و همشون داوطلبانه حاضر بودن برای کسترش این جوامع همکاری کنند</p>\n<p>توجه <strong>اکوسیستم برگزاری جوامع در شیراز</strong> منو جذب کرد و اینجا میخواستم به هر شکلی که هست همه مناسبت های نرم افزار ازاد تا برنامه نویسی رو اجرا کنم و اولین همایش های برخی از تخصص های نوپا این حوزه رو در شیراز برگزار کنیم </p>\n<p>و همین شد که <strong>همایش ۸۰۰ نفری گنو/لینوکس</strong> رو اجرا کردیم و به همین ترتیب <strong>اولین همایش دواپس ایران</strong> رو هم اجرا کردیم.</p>\n<p>در ادامه یه جامعه هوش مصنوعی هم به شیراز اوردم و <strong>فیلاگراکس‌شیراز</strong> رو تشکیل دادیم </p>\n<p>توی همین اتفاقا من برای مدیریت تیم های داوطلب نیازمند یادگیری دوره های مدیریت شدم و در کنارش منابع های مورد نیاز کارمو دنبال میکردم </p>\n<p class=\"msg--success msg--highlight msg \">و بعد از فیلاگر تشکیل جامعه سی اس فیفتی توجهمو جلب کرده بود که اینجا رو هم با بچه ها شروعش کردیم</p>\n<p class=\"msg msg--highlight \">سال ۱۴۰۲ با تشکیل یک تیم برگزارکننده برای فینگرکدر خودم به عنوان بنیان گذر این جامعه از فینگرکدر خدافظی کردم با هدف ارتقا و تشکیل دیگر جوامع وو انتقال دانش برگزاری </p>\n<p>سی اس فیفتی رو <strong>۶۰ نفر داوطلب</strong> شرووع به برگزاریش کردیم و این طرف بشدت تجربه های مدیریتی - مارکتینگ - روابط عمومی و منابع انسانی دریافت کردم و این جامعه رو هم در <strong>شیراز</strong> اجراش کردیم </p>\n<p>در ادامه همین مطالب لازمه بگم یه جایی به بعد توسعه و ارتقای جامعه های برنامه نویسی شد روتین زندگیم و چندین ساله که فعالیت اصلیم شده همین کار</p>\n<p>خوب تا اینجا این چیزایی بود که لازم بود از خودم بگم </p>\n<p>اما در ادامه خارج از این موارد لازمه بگم این وبلاگ کلا به جهت انتشار تجربه های خودم در خصوص برگزاری های موفق در این زمینه ها طراحی و تشکیل شده البته برخی وقتا ممکنه به موضوعات دیگه ای هم بپردازم ولی در کل هر چیزی که نیازمندی انتقالش رو ببینم و بتونم منتقلش کنم اصلا دریغ نمیکنم و اینکارو ادامه میدم </p>\n<p>در ادامه میگم که اصلا از ترک تحصیل پشیمون نیستم تا امروزم سربازی نرفتم و از اونم پشیمون نیستم در حال حاضر </p>\n<p>از کمک کردن به ادما انرژی خوبی دریافت میکنم و این موردو تووی جامعه های خوم بشدت حس میکنم و اینجا به بعدو خدا میدونه چی میشه ولی هر چی بشه مهم اینه حس خودت خوب باشه</p>\n<p> </p>\n<p>مرسی که تا اینجا اومدی - این پست ممکنه در تاریخ های مختلف آپدیت بگیره و بخش هایی رو بهش اضافه کنم </p>\n<p> </p>",
            "author": {
                "name": "عباس داورپناه"
            },
            "tags": [
                   "عباس داوپناه"
            ],
            "date_published": "2024-09-28T01:11:21+03:30",
            "date_modified": "2024-09-29T01:57:14+03:30"
        }
    ]
}
